apps/api/app/Controllers/Api/V1/Auth.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = 1
---
    public function sync(): ResponseInterface
    {
        $userId = (int) $this->request->getHeaderLine('X-Auth-UserId');
        $users  = model(\App\Models\UserModel::class);
        $u      = $users->find($userId);