apps/api/app/Controllers/Api/V1/Me.php

    public function show(): ResponseInterface
    {
        $userId = (int) $this->request->getHeaderLine('X-Auth-UserId');
        $users  = model(\App\Models\UserModel::class);
        $u      = $users->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = 78