apps/api/app/Models/AuditoriaModel.php

INSERT INTO `auditoria` (`actor_id`, `accion`, `entidad_tipo`, `entidad_id`, `metadata`, `ip`, `created_at`) VALUES (1, 'ver_documento_verificacion', 'documentos_verificacion', 1, '{\"user_id\":\"1\"}', '127.0.0.1', '2026-06-08 22:47:27')
---
    public function registrar(
        int $actorId,
        string $accion,
        string $entidadTipo,
        int $entidadId,
        array $metadata = [],
        ?string $ip = null,
    ): int {
        $this->insert([
            'actor_id'     => $actorId,
            'accion'       => $accion,
            'entidad_tipo' => $entidadTipo,
            'entidad_id'   => $entidadId,
            'metadata'     => $metadata !== [] ? json_encode($metadata) : null,
            'ip'           => $ip,
        ]);