apps/api/app/Models/CategoriaModel.php

SELECT *
FROM `categorias`
WHERE `activa` = 1
ORDER BY `nombre`
---
    public function activas(): array
    {
        return $this->where('activa', 1)->orderBy('nombre')->findAll();