apps/api/app/Models/DocumentoVerificacionModel.php

SELECT `documentos_verificacion`.*, `users`.`nombre`, `users`.`email`, `users`.`foto_perfil`, `users`.`fecha_nacimiento`, `users`.`genero`, `users`.`telefono`
FROM `documentos_verificacion`
JOIN `users` ON `users`.`id` = `documentos_verificacion`.`user_id`
WHERE `documentos_verificacion`.`estado` = 'pendiente'
ORDER BY `documentos_verificacion`.`created_at` ASC
---
    public function pendientesConUsuario(): array
    {
        return $this->select('documentos_verificacion.*, users.nombre, users.email, users.foto_perfil, users.fecha_nacimiento, users.genero, users.telefono')
            ->join('users', 'users.id = documentos_verificacion.user_id')
            ->where('documentos_verificacion.estado', 'pendiente')
            ->orderBy('documentos_verificacion.created_at', 'ASC')
            ->findAll();