apps/api/app/Models/OfertaModel.php

SELECT COUNT(*) AS `numrows`
FROM `ofertas` `o`
JOIN `users` `u` ON `u`.`id` = `o`.`user_id`
WHERE `o`.`estado` = 'activa'
SELECT `o`.`id`, `o`.`titulo`, `o`.`descripcion_breve`, `o`.`modalidad`, `o`.`zona`, `o`.`categoria_id`, `o`.`created_at`, `u`.`id` AS `oferente_id`, `u`.`nombre` AS `oferente_nombre`, `u`.`foto_perfil` AS `oferente_foto`, (u.deleted_at IS NOT NULL) AS oferente_inactivo
FROM `ofertas` `o`
JOIN `users` `u` ON `u`.`id` = `o`.`user_id`
WHERE `o`.`estado` = 'activa'
ORDER BY `o`.`created_at` DESC
 LIMIT 8
---
    public function explorar(array $filtros, int $page, int $perPage): array
    {
        $builder = $this->db->table('ofertas o')
            ->select('o.id, o.titulo, o.descripcion_breve, o.modalidad, o.zona, o.categoria_id, o.created_at, u.id AS oferente_id, u.nombre AS oferente_nombre, u.foto_perfil AS oferente_foto, (u.deleted_at IS NOT NULL) AS oferente_inactivo')
            ->join('users u', 'u.id = o.user_id')
            ->where('o.estado', 'activa');

        if (! empty($filtros['categoria_id'])) {
            $builder->where('o.categoria_id', (int) $filtros['categoria_id']);
        }
        if (! empty($filtros['modalidad'])) {
            $builder->where('o.modalidad', $filtros['modalidad']);
        }
        if (! empty($filtros['zona'])) {
            $builder->like('o.zona', $filtros['zona']);
        }
        if (! empty($filtros['q'])) {
            $q = $filtros['q'];
            $builder->groupStart()
                ->like('o.titulo', $q)
                ->orLike('o.descripcion_breve', $q)
                ->groupEnd();
        }

        $total = $builder->countAllResults(false);

        $items = $builder
            ->orderBy('o.created_at', 'DESC')
            ->limit($perPage, ($page - 1) * $perPage)
            ->get()
            ->getResultArray();

SELECT `ofertas`.*, `c`.`nombre` AS `categoria_nombre`
FROM `ofertas`
LEFT JOIN `categorias` `c` ON `c`.`id` = `ofertas`.`categoria_id`
WHERE `ofertas`.`user_id` = 1
AND `ofertas`.`estado` != 'eliminada'
ORDER BY `ofertas`.`created_at` DESC
---
    public function porUsuario(int $userId): array
    {
        return $this->select('ofertas.*, c.nombre AS categoria_nombre')
            ->join('categorias c', 'c.id = ofertas.categoria_id', 'left')
            ->where('ofertas.user_id', $userId)
            ->where('ofertas.estado !=', 'eliminada')
            ->orderBy('ofertas.created_at', 'DESC')
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `ofertas` `o`
JOIN `users` `u` ON `u`.`id` = `o`.`user_id`
LEFT JOIN `categorias` `c` ON `c`.`id` = `o`.`categoria_id`
SELECT `o`.*, `u`.`nombre` AS `oferente_nombre`, `u`.`foto_perfil` AS `oferente_foto`, `c`.`nombre` AS `categoria_nombre`
FROM `ofertas` `o`
JOIN `users` `u` ON `u`.`id` = `o`.`user_id`
LEFT JOIN `categorias` `c` ON `c`.`id` = `o`.`categoria_id`
ORDER BY `o`.`created_at` DESC
 LIMIT 20
---
    public function listarAdmin(array $filtros, int $page, int $perPage): array
    {
        $builder = $this->db->table('ofertas o')
            ->select('o.*, u.nombre AS oferente_nombre, u.foto_perfil AS oferente_foto, (u.deleted_at IS NOT NULL) AS oferente_inactivo, c.nombre AS categoria_nombre')
            ->join('users u', 'u.id = o.user_id')
            ->join('categorias c', 'c.id = o.categoria_id', 'left');

        if (! empty($filtros['estado'])) {
            $builder->where('o.estado', $filtros['estado']);
        }
        if (! empty($filtros['categoria_id'])) {
            $builder->where('o.categoria_id', (int) $filtros['categoria_id']);
        }
        if (! empty($filtros['q'])) {
            $q = $filtros['q'];
            $builder->groupStart()
                ->like('o.titulo', $q)
                ->orLike('o.descripcion_breve', $q)
                ->groupEnd();
        }

        $total = $builder->countAllResults(false);

        $items = $builder
            ->orderBy('o.created_at', 'DESC')
            ->limit($perPage, ($page - 1) * $perPage)
            ->get()
            ->getResultArray();