apps/api/app/Models/ResenaModel.php

SELECT COUNT(*) AS `numrows`
FROM `resenas` `r`
JOIN `users` `u` ON `u`.`id` = `r`.`autor_id`
JOIN `vinculaciones` `v` ON `v`.`id` = `r`.`vinculacion_id`
JOIN `ofertas` `o` ON `o`.`id` = `v`.`oferta_id`
WHERE `r`.`destino_id` = 1
AND `r`.`oculta` = 0
SELECT `r`.`id`, `r`.`vinculacion_id`, `r`.`autor_id`, `r`.`calificacion`, `r`.`comentario`, `r`.`created_at`, `u`.`nombre` AS `autor_nombre`, `u`.`foto_perfil` AS `autor_foto`, (u.deleted_at IS NOT NULL) AS autor_inactivo, `o`.`titulo` AS `oferta_titulo`
FROM `resenas` `r`
JOIN `users` `u` ON `u`.`id` = `r`.`autor_id`
JOIN `vinculaciones` `v` ON `v`.`id` = `r`.`vinculacion_id`
JOIN `ofertas` `o` ON `o`.`id` = `v`.`oferta_id`
WHERE `r`.`destino_id` = 1
AND `r`.`oculta` = 0
ORDER BY `r`.`created_at` DESC
 LIMIT 10
---
    public function porDestinoPublicas(int $destinoId, int $page = 1, int $perPage = 10): array
    {
        $builder = $this->db->table('resenas r')
            ->select('r.id, r.calificacion, r.comentario, r.created_at, u.nombre AS autor_nombre, u.foto_perfil AS autor_foto, o.titulo AS oferta_titulo')
            ->join('users u', 'u.id = r.autor_id')
            ->join('vinculaciones v', 'v.id = r.vinculacion_id')
            ->join('ofertas o', 'o.id = v.oferta_id')
            ->where('r.destino_id', $destinoId)
            ->where('r.oculta', 0);

        $total = $builder->countAllResults(false);

        $items = $builder
            ->orderBy('r.created_at', 'DESC')
            ->limit($perPage, ($page - 1) * $perPage)
            ->get()
            ->getResultArray();

SELECT AVG(calificacion) AS promedio, COUNT(*) AS total
FROM `resenas`
WHERE `destino_id` = 1
AND `oculta` = 0
---
    public function estadisticas(int $destinoId): array
    {
        $row = $this->db->table('resenas')
            ->select('AVG(calificacion) AS promedio, COUNT(*) AS total')
            ->where('destino_id', $destinoId)
            ->where('oculta', 0)
            ->get()
            ->getRowArray();