apps/api/app/Models/TicketModel.php

SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `creador_id` = 78
SELECT *
FROM `tickets`
WHERE `creador_id` = 78
ORDER BY `created_at` DESC
 LIMIT 20
---
    public function porCreador(int $creadorId, int $page, int $perPage): array
    {
        $builder = $this->where('creador_id', $creadorId);

        $total = $builder->countAllResults(false);

        $items = $builder
            ->orderBy('created_at', 'DESC')
            ->limit($perPage, ($page - 1) * $perPage)
            ->findAll();