apps/api/app/Models/UserModel.php

    public function porFirebaseUid(string $uid): ?array
    {
        return $this->where('firebase_uid', $uid)->where('estado_cuenta !=', 'baja')->first();
---
SELECT *
FROM `users`
WHERE `firebase_uid` = 'tgGB8wqIsPbS9Ki6Lj1pI8jH3xB3'
AND `estado_cuenta` != 'baja'
AND `users`.`deleted_at` IS NULL
 LIMIT 1

    public function rolesDe(int $userId): array
    {
        $rows = $this->db->table('role_user ru')
            ->select('r.nombre')->join('roles r', 'r.id = ru.role_id')
            ->where('ru.user_id', $userId)->get()->getResultArray();
---
SELECT `r`.`nombre`
FROM `role_user` `ru`
JOIN `roles` `r` ON `r`.`id` = `ru`.`role_id`
WHERE `ru`.`user_id` = 78