apps/api/app/Models/VinculacionModel.php

SELECT `v`.*, `o`.`titulo` AS `oferta_titulo`, `o`.`user_id` AS `oferente_id`, `ub`.`nombre` AS `buscador_nombre`, `ub`.`foto_perfil` AS `buscador_foto`, `uo`.`nombre` AS `oferente_nombre`, `uo`.`foto_perfil` AS `oferente_foto`
FROM `vinculaciones` `v`
JOIN `ofertas` `o` ON `o`.`id` = `v`.`oferta_id`
JOIN `users` `ub` ON `ub`.`id` = `v`.`buscador_id`
JOIN `users` `uo` ON `uo`.`id` = `o`.`user_id`
WHERE `v`.`id` = 22
---
    public function conDetalles(int $id): ?array
    {
        return $this->db->table('vinculaciones v')
            ->select('v.*, o.titulo AS oferta_titulo, o.user_id AS oferente_id, ub.nombre AS buscador_nombre, ub.foto_perfil AS buscador_foto, uo.nombre AS oferente_nombre, uo.foto_perfil AS oferente_foto')
            ->join('ofertas o', 'o.id = v.oferta_id')
            ->join('users ub', 'ub.id = v.buscador_id')
            ->join('users uo', 'uo.id = o.user_id')
            ->where('v.id', $id)
            ->get()
            ->getRowArray();

SELECT COUNT(*) AS `numrows`
FROM `vinculaciones` `v`
JOIN `ofertas` `o` ON `o`.`id` = `v`.`oferta_id`
JOIN `users` `ub` ON `ub`.`id` = `v`.`buscador_id`
JOIN `users` `uo` ON `uo`.`id` = `o`.`user_id`
WHERE   (
`v`.`buscador_id` = 1
OR `o`.`user_id` = 1
 )
AND `v`.`estado` = 'aceptada'
SELECT COUNT(*) AS `numrows`
FROM `vinculaciones` `v`
JOIN `ofertas` `o` ON `o`.`id` = `v`.`oferta_id`
JOIN `users` `ub` ON `ub`.`id` = `v`.`buscador_id`
JOIN `users` `uo` ON `uo`.`id` = `o`.`user_id`
WHERE   (
`v`.`buscador_id` = 1
OR `o`.`user_id` = 1
 )
AND `v`.`estado` = 'completada'
SELECT `v`.*, `o`.`titulo` AS `oferta_titulo`, `o`.`user_id` AS `oferente_id`, `ub`.`nombre` AS `buscador_nombre`, `ub`.`foto_perfil` AS `buscador_foto`, `uo`.`nombre` AS `oferente_nombre`, `uo`.`foto_perfil` AS `oferente_foto`
FROM `vinculaciones` `v`
JOIN `ofertas` `o` ON `o`.`id` = `v`.`oferta_id`
JOIN `users` `ub` ON `ub`.`id` = `v`.`buscador_id`
JOIN `users` `uo` ON `uo`.`id` = `o`.`user_id`
WHERE   (
`v`.`buscador_id` = 1
OR `o`.`user_id` = 1
 )
AND `v`.`estado` = 'aceptada'
ORDER BY `v`.`created_at` DESC
 LIMIT 12
---
    public function porUsuario(int $userId, ?string $estado = null, ?string $rol = null, int $page = 1, int $perPage = 12): array
    {
        $builder = $this->db->table('vinculaciones v')
            ->select('v.*, o.titulo AS oferta_titulo, o.user_id AS oferente_id, ub.nombre AS buscador_nombre, ub.foto_perfil AS buscador_foto, uo.nombre AS oferente_nombre, uo.foto_perfil AS oferente_foto')
            ->join('ofertas o', 'o.id = v.oferta_id')
            ->join('users ub', 'ub.id = v.buscador_id')
            ->join('users uo', 'uo.id = o.user_id');

        if ($rol === 'buscador') {
            $builder->where('v.buscador_id', $userId);
        } elseif ($rol === 'oferente') {
            $builder->where('o.user_id', $userId);
        } else {
            $builder->groupStart()
                ->where('v.buscador_id', $userId)
                ->orWhere('o.user_id', $userId)
                ->groupEnd();
        }

        if ($estado !== null && $estado !== '') {
            $builder->where('v.estado', $estado);
        }

        $total = $builder->countAllResults(false);

        $items = $builder
            ->orderBy('v.created_at', 'DESC')
            ->limit($perPage, ($page - 1) * $perPage)
            ->get()
            ->getResultArray();