apps/api/app/Controllers/Api/V1/Admin/Ofertas.php

    public function show(int $id): ResponseInterface
    {
        $db     = \Config\Database::connect();
        $oferta = $db->table('ofertas o')
            ->select('o.*, u.id AS user_id, u.nombre AS oferente_nombre, u.foto_perfil AS oferente_foto, (u.deleted_at IS NOT NULL) AS oferente_inactivo')
            ->join('users u', 'u.id = o.user_id', 'left')
            ->where('o.id', $id)
            ->get()
            ->getRowArray();

        if ($oferta === null) {
            return $this->notFound('Oferta no encontrada.');
        }

        $imagenes  = $db->table('oferta_imagenes')
            ->where('oferta_id', $id)
            ->orderBy('orden', 'ASC')
            ->get()
            ->getResultArray();
        $vincCount = $db->table('vinculaciones')->where('oferta_id', $id)->countAllResults();
---
SELECT `o`.*, `u`.`id` AS `user_id`, `u`.`nombre` AS `oferente_nombre`, `u`.`foto_perfil` AS `oferente_foto`, (u.deleted_at IS NOT NULL) AS oferente_inactivo
FROM `ofertas` `o`
LEFT JOIN `users` `u` ON `u`.`id` = `o`.`user_id`
WHERE `o`.`id` = 64
SELECT *
FROM `oferta_imagenes`
WHERE `oferta_id` = 64
ORDER BY `orden` ASC
SELECT COUNT(*) AS `numrows`
FROM `vinculaciones`
WHERE `oferta_id` = 64