apps/api/app/Controllers/Api/V1/Admin/Usuarios.php

    public function index(): ResponseInterface
    {
        $estadoVerificacion = $this->request->getGet('estado_verificacion');
        $estadoCuenta       = $this->request->getGet('estado_cuenta');
        $q                  = $this->request->getGet('q');
        $page               = (int) ($this->request->getGet('page') ?? 1);
        $perPage            = (int) ($this->request->getGet('per_page') ?? 20);
        $page               = max(1, $page);
        $perPage            = min(50, max(1, $perPage));

        $userModel = model(UserModel::class);
        $builder = $userModel->db->table('users')
            ->select('id, nombre, email, foto_perfil, estado_verificacion, estado_cuenta, zona, created_at')
            ->where('deleted_at IS NULL');

        if ($estadoVerificacion !== null && $estadoVerificacion !== '') {
            $builder->where('estado_verificacion', $estadoVerificacion);
        }
        if ($estadoCuenta !== null && $estadoCuenta !== '') {
            $builder->where('estado_cuenta', $estadoCuenta);
        }
        if ($q !== null && $q !== '') {
            $builder->groupStart()
                ->like('nombre', $q)
                ->orLike('email', $q)
                ->groupEnd();
        }

        $total = $builder->countAllResults(false);

        $items = $builder
            ->orderBy('created_at', 'DESC')
            ->limit($perPage, ($page - 1) * $perPage)
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `deleted_at` IS NULL
AND `estado_cuenta` = 'activa'
SELECT `id`, `nombre`, `email`, `foto_perfil`, `estado_verificacion`, `estado_cuenta`, `zona`, `created_at`
FROM `users`
WHERE `deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 20