apps/api/app/Services/VerificacionService.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = 2
---
    public function consultarEstado(int $userId): array
    {
        $user = $this->users->find($userId);